CSI API ETABS v1
cLinkObj.GetLocalAxes Method
 Retrieves the local axis angle assignment for link objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLocalAxes(
	string Name,
	ref double Ang,
	ref bool Advanced
)
Function GetLocalAxes (
	Name As String,
	ByRef Ang As Double,
	ByRef Advanced As Boolean
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim Ang As Double
Dim Advanced As Boolean
Dim returnValue As Integer
returnValue = instance.GetLocalAxes(Name,
	Ang, Advanced)
int GetLocalAxes(
	String^ Name,
	double% Ang,
	bool% Advanced
)
abstract GetLocalAxes :
        Name : string *
        Ang : float byref *
        Advanced : bool byref -> int
Parameters
Name
Type: System.String
The name of an existing link object.
Ang
Type: System.Double
This is the angle that the local 2 and 3 axes are rotated about the positive local 1 axis, from the default orientation. The rotation for a positive angle appears counter clockwise when the local +1 axis is pointing toward you. [deg].
Advanced
Type: System.Boolean
This item is True if the link object local axes orientation was obtained using advanced local axes parameters.
Return Value
Type: Int32
Returns zero if the assignment is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim Ang As Double
       Dim Advanced As boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'assign link local axis angle
       ret = SapModel.LinkObj.SetLocalAxes(Name, 30)
   'get link local axis angle
       ret = SapModel.LinkObj.GetLocalAxes(Name, Ang, Advanced)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace